Repository: MostafaAdel10/BookShop
Catalog: BookShop.Core/Resources/SharedResources.*.resx
Languages: ar

source: Algorithm Is Wrong
ar: هناك خطأ في الخوارزمية المستخدمة في التشفير

# BadRequest
source: Request Can't be Understand
ar: هذا الطلب لا يمكن فهمه

# ChangePassFailed
source: Change Password Failed
ar: حدث خطأ اثناء عملية تغيير الباسورد

source: Add Failed
ar: حدث خطأ في الاضافة

source: Confirm Email Done
ar: تم التأكيد الايميل بنجاح

# Created
source: Created Successfully
ar: تم الاضافة بنجاح

# Deleted
source: Deleted Successfully
ar: تم الحذف بنجاح

# DeletedFailed
source: Delete Operation Failed
ar: حدث خطأ اثناء عملية حذف البيانات

source: Subsubject Id
ar: معرف الموضوع الفرعي

source: Subject Id
ar: معرف الموضوع

source: Email
ar: الايميل

# EmailIsExist
source: Email is Already Exist
ar: الايميل الذي ادخلته موجود بالفعل

# EmailNotConfirmed
source: Please Confirm Your Email
ar: من فضلك قم بتأكيد الايميل

# ErrorWhenConfirmEmail
source: Error Occur When Confirm Email
ar: حدث خطأ اثناء تأكيد الايميل

# FaildToAddUser
source: Failed To Add USer.
ar: حدث خطأ اثناء اضافة المستخدم

# FailedToAddNewClaims
source: Operation is Failed To Add New Claims
ar: حدث حطأ اثناء اضافة صلاحيات الاستخدام جديدة للمستخدمين

# FailedToAddNewRoles
source: Operation is Failed To Add User Roles
ar: فشلت عملية اضافة صلاحيات جديدة للمستخدم

# FailedToRemoveOldClaims
source: Operation is Failed To Remove Old Claims
ar: حدث حطأ اثناء حذف صلاحيات الاستخدام القديمة للمستخدمين

# FailedToRemoveOldRoles
source: Operation is Failed To Remove Old Roles
ar: فشلت عملية حذف الصلاحيات القديمة

# FailedToUpdateClaims
source: Operation is Failed To Update Claims
ar: حدث حطأ اثناء تحديث صلاحيات الاستخدام للمستخدمين

# FailedToUpdateUserRoles
source: Operation is Failed To Update User Roles
ar: فشلت عملية تحديث الصلاحيات للمستخدم

source: Failed To Upload Image.
ar: حدث خطأ اثناء رفع الصورة

source: Invaild Code.
ar: هذا الكود غير صحيح

# IsExist
source: Is Already Exist
ar: موجود بالفعل

source: is Not Exist
ar: غير موجود

# MaxLengthis100
source: Must not exceed 100 characters.
ar: 100 يجب ان لا يذيد طول النص عن

source: Message
ar: الرسالة

source: Name
ar: الاسم

# NoImage
source: Please Select Image
ar: من فضلك قم بإختيار صورة

# NotEmpty
source: Must Not Empty
ar: لا يمكن ترك العنصر فارغ

source: Not Found
ar: غير متوفر

source: Password
ar: الباسورد

# PasswordNotCorrect
source: Password is Not Correct
ar: هذا الباسورد غير صحيح

# PasswordNotEqualConfirmPass
source: Password And Confirm Password Not Equals.
ar: الباسورد والباسورد المؤكد يجب ان يكونوا متساويين

source: Refresh Token Is Expired
ar: رمز التنشيط الذي تستخمه انتهت صلاحية

source: Refresh Token Is Not Found
ar: رمز التنشيط الذي تستخمه ليس موجود

# Required
source: This Field Is Required
ar: هذا الحقل مطلوب

# RoleIsUsed
source: Role is already in use
ar: هذه الصلاحية مستخدمة بالفعل لا يمكن الحذف

# RoleNotExist
source: Role is not exist
ar: هذه الصلاحية ليست موجوده

# SendEmailFailed
source: Operation to send email failed.
ar: حدث خطأ اثناء ارسال الايميل

# Success
source: operation is done
ar: تمت العملية بنجاح

source: Token Is Expired
ar: رمز الوصول الذي تستخدمة منتهي الصلاحية

source: Token Is Not Expired
ar: رمز الوصول الذي تستخدمة ليس منتهي

source: Try Again In Another Time
ar: حدث خطأ اثناء العملية من فضلك حاول مره اخري في وقت لاحق

# TryToRegisterAgain
source: Operation Is Failed, Try To Register Again
ar: حدث خطأ غير متوقع اعد المحاولة مره اخري

# UnAuthorized
source: You are not Authorized To Access This Resources
ar: لا تملك الصلاحية للوصول لتلك المصادر

# UnprocessableEntity
source: There are Validation Errors Or Syntax Errors
ar: يوجد مشاكل في صيغة الداتا او نوعها عن المطلوب

# Updated
source: Updated Successfully
ar: تم التعديل بنجاح

# UpdateFailed
source: Update Operation Failed
ar: حدث خطأ اثناء عملية تحديث البيانات

source: User Is Not Found
ar: المستخدم غير موجود

source: User Name
ar: اسم المستخدم

# UserNameIsExist
source: UserName is Already Exist
ar: اسم المستخدم هذا موجود بالفعل

source: UserName Is Not Exist
ar: اسم المستخدم هذا غير موجود

# MaxLengthis300
source: Must not exceed 300 characters.
ar: 300 يجب ان لا يذيد طول النص عن

# MaxLengthis13
source: Must be 13 digits.
ar: يجب أن يتكون من 13 رقمًا

# DateTime
source: The publication date must be in the past.
ar: يجب أن يكون تاريخ النشر في الماضي.

# Greater
source: must be greater than 0.
ar: يجب أن يكون أكبر من 0

source: Title
ar: العنوان

source: Description
ar: الوصف

source: ISBN-13
ar: ISBN-13 رقم الكتاب الدولي المعياري

source: Author
ar: المؤلف

source: Price
ar: السعر

source: Price After Discount
ar: السعر بعد الخصم

source: Publisher
ar: الناشر

source: Publication Date
ar: تاريخ النشر

source: Unit_Instock
ar: الوحدة المتوفرة

source: Image_url.
ar: رابط الصورة

# MaxLengthis10
source: Must be 10 digits.
ar: يجب أن يتكون من 13 رقمًا

source: ISBN-10
ar: ISBN-10 رقم الكتاب الدولي المعياري

# between200and1000
source: must be between 200 and 1000
ar: يجب أن يكون بين 200 و 1000

# AfterStartDate
source: must be after start date.
ar: يجب أن يكون بعد تاريخ البدء

# between0and100
source: must be between 0 and 100.
ar: يجب أن يكون بين 0 و 100

# InvalidFileType
source: Invalid file type. Allowed types: .jpg, .png, .jpeg, .svg.
ar: نوع الملف غير صالح. الأنواع المسموح بها: .jpg، .png، .jpeg، .svg.

# MaxLengthIs50
source: Must not exceed 50 characters.
ar: 50 يجب ان لا يذيد طول النص عن

# RatingBetween1and5
source: Rating should be between 1 and 5.
ar: يجب أن يكون التقييم بين 1 و 5

# ContainOnlyDigits
source: must contain only digits
ar: يجب أن يحتوي فقط على أرقام

# MaxLengthIs16
source: must be exactly 16 digits long
ar: يجب أن يكون طوله 16 رقمًا بالضبط

# TotalAmount
source: must be between 0.01 and 1,000,000.
ar: يجب أن يكون بين 0.01 و 1،000،000

# MaxLengthIs15
source: Must not exceed 15 characters.
ar: يجب ألا يتجاوز 15 حرفًا

# MaxLengthIs1500
source: Must not exceed 1500 characters.
ar: يجب ألا يتجاوز 1500 حرفًا.

source: Price Is Not True
ar: السعر ليس صحيحا

# QuantityIsGreater
source: Quantity Is Greater Than Unite in stock.
ar: الكمية أكبر من الوحدة الموجودة في المخزون

source: Book Is Not Exist
ar: الكتاب غير موجود

source: The Book Is Not Available
ar: الكتاب غير متوفر

source: Must Be At Least 1000.
ar: يجب أن يكون على الأقل 1000

source: OrderId Or UserId Is Not Exist
ar: معرف الطلب أو معرف المستخدم غير موجود

source: Quantity Cannot Be 0 Or Less
ar: الكمية لا يمكن أن تكون 0 أو أقل

source: No Changes
ar: لا يوجد تغييرات

# MaxLengthIs25
source: Must not exceed 25 characters.
ar: يجب ألا يتجاوز 25 حرفًا

# MaxLengthIs255
source: Must not exceed 255 characters.
ar: لا يجب أن يتجاوز 255 حرفًا

source: UserName Or Password Is Not Exist.
ar: اسم المستخدم أو كلمة المرور غير موجودة
